Repository: BoyNextDoor-228/iteco_test
Catalog: app/lib/l10n/intl_*.arb
Languages: ru

source: Main page
ru: Главная страница

source: Products list
ru: Список продуктов

source: Quit
ru: Выход

# home_screen_info_text
source: Here goes the main page, which ws made for nothing. If you're looking for a page with products list, you probably should look for it in burger menu. You can also look at this application with device dark theme turned on
ru: Тут находится домашняя страница, которая была сделана просто так. Если ищите страницу со списком продуктов, то, возможно, Вам стоит заглянуть в бургер-меню. А ещё можно посмотреть на приложение, если включить на устройстве тёмный режим

# greeting_subpage_title
source: Hello!
ru: Привет!

# page_control_button_back
source: Back
ru: Назад

# page_control_button_forward
source: Next
ru: Далее

# lets_start_subpage_title
source: Let's roll!
ru: Поехали!

# lets_start_subpage_button_text
source: Go to application!
ru: Отправиться в приложение!

# product_list_demo_subpage_title
source: Infinite products scroll!
ru: Бесконечный скролл продуктов!

# greeting_subpage_information
source: You're on onborading page, which is required by technical task! This page will be shown once, on application launched for the very first time! Have a nice watching!
ru: Вы попали на страницу онбординга, требуемую техническим заданием! Эта страница будет демонстрироваться единожды при первом запуске приложения! Приятного просмотра!

# splash_subpage_information
source: On application launch you could have noticed Splash-screen - it's presence was required by technical task. It was implemented using flutter_splash_screen package.
ru: При запуске приложения Вы могли заметить Splash-screen - его наличие требовалось техническим заданием. Реализован он с помощью пакета flutter_splash_screen.

# lets_start_subpage_information
source: It was an onboarding of the test application!
ru: Это был онбординг тестового приложения!

# product_list_loading_error
source: Failed to load products list.
ru: Не получилось загрузить список продуктов.

# product_list_retry_button_text
source: Retry
ru: Повторить попытку

# product_list_absence_text
source: Products catalogue is empty, maybe, it will be filled later
ru: Каталог продуктов пуст, возможно, он будет пополнен позже

# empty_product_list_reload_button_text
source: Retry
ru: Повторить попытку

# feedbacksAmount
source: Feedbacks count: {ratingCount}
ru: Кол-во отзывов: {ratingCount}
