const greetingText = '''
Вы попали на страницу онбординга, требуемую техническим заданием!'\n
    Поскольку в задании не было указано, что страница онбординга должна демонстрироваться единожды при первом запуске приложения, было принято решение показывать её каждый раз!\n
    Приятного просмотра!''';

const splashScreenText = '''
При запуске приложения Вы могли заметить Splash-screen - его наличие требовалось техническим заданием.\n
Реализован он с помощью пакета flutter_splash_screen.
''';

const letsStartText = '''
Это был онбординг тестового приложения!
''';
